{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.14.0", "signature": {"inputs": {"InputLayer": {"name": "inputlayer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"Conv4": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Reflection/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_4/resize/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_5/resize/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "32"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "inputlayer", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_35/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_35/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_33/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_33/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_5/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_5/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_32/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_32/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_46/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_46/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_45/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_45/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_43/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_43/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_41/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_41/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_39/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_39/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_37/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_37/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Reflection/MirrorPad", "op": "MirrorPad", "input": ["inputlayer", "StatefulPartitionedCall/Transform_network/Reflection/Const"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/Reflection/MirrorPad", "StatefulPartitionedCall/Transform_network/Conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_32/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_32/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_32/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_32/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_32/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_32/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_33/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv2/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_33/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_33/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_33/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_33/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_33/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv3/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice/stack", "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice/stack_1", "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "9"}, "begin_mask": {"i": "9"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_35/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_35/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_35/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_35/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_35/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_36/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_35/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_weights", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/Transform_network/add_11/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_36/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/add_11/add", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Transform_network/add_11/add", "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice/stack", "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice/stack_1", "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "9"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "9"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_37/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_37/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_37/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_37/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_37/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_38/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_37/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_weights", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "VkFMSUQ="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/add_12/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_38/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/add_12/add", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Transform_network/add_12/add", "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice/stack", "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice/stack_1", "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "9"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "9"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_39/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_39/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_39/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_39/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_39/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_40/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_39/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_weights", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Transform_network/add_13/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_40/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/add_13/add", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Transform_network/add_13/add", "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice/stack", "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice/stack_1", "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "9"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "9"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_41/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_41/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_41/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_41/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_41/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_42/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_41/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_weights", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/Transform_network/add_14/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_42/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/add_14/add", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Transform_network/add_14/add", "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice/stack", "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice/stack_1", "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "9"}, "end_mask": {"i": "9"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_43/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_43/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_43/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_43/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_43/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_44/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_43/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_5/Conv2D_weights", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/Transform_network/add_15/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_44/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_4/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/Transform_network/add_15/add", "StatefulPartitionedCall/Transform_network/tf.image.resize_4/resize/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/tf.image.resize_4/resize/ResizeBilinear", "StatefulPartitionedCall/Transform_network/Deconv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Deconv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_45/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Deconv1/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_45/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_45/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_45/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_45/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_5/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_45/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/tf.image.resize_5/resize/size"], "attr": {"half_pixel_centers": {"b": true}, "align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/tf.image.resize_5/resize/ResizeBilinear", "StatefulPartitionedCall/Transform_network/Deconv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Deconv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_46/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Deconv2/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_46/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_46/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_46/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_46/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_46/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/Transform_network/Conv4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/Transform_network/Conv4/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Reflection/Const", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1/Conv2D/ReadVariableOp", "shape": [9, 9, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv3/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_11/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_12/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_13/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_14/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_15/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_4/resize/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/Deconv1/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Deconv1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_5/resize/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/Deconv2/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Deconv2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/Conv2D/ReadVariableOp", "shape": [9, 9, 32, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_35/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_35/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_34/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_33/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_33/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_5/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_5/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_32/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": 