{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"InputLayer": {"name": "inputlayer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"tf.math.tanh_4": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "inputlayer", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_5/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_5/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_6/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_6/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv1/Relu", "op": "_FusedConv2D", "input": ["inputlayer", "StatefulPartitionedCall/Medium_network_deconvs/Conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Medium_network_deconvs/Conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_5/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Conv1/Relu", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_5/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_5/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_5/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_5/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_5/FusedBatchNormV3", "StatefulPartitionedCall/Medium_network_deconvs/Conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Medium_network_deconvs/Conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_6/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Conv2/Relu", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_6/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_6/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_6/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_6/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_6/FusedBatchNormV3", "StatefulPartitionedCall/Medium_network_deconvs/Conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Medium_network_deconvs/Conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Conv3/Relu", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv1/Shape", "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice/stack", "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice/stack_1", "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice", "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack/1", "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack/2", "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack", "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv1/conv2d_transpose", "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv1/Relu", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv2/Shape", "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice/stack", "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice/stack_1", "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice", "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack/1", "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack/2", "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack", "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv2/conv2d_transpose", "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv2/Relu", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv3/Shape", "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice/stack", "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice/stack_1", "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack", "op": "Pack", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice", "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack/1", "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack/2", "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack", "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv3/conv2d_transpose", "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/tf.math.tanh_4/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/Medium_network_deconvs/Deconv3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/Medium_network_deconvs/tf.math.tanh_4/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/conv2d_transpose/ReadVariableOp", "shape": [9, 9, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv1/Conv2D/ReadVariableOp", "shape": [9, 9, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Conv3/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/Deconv3/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_5/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_5/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_9/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_8/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_7/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_6/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Medium_network_deconvs/batch_normalization_6/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}]}]}