{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.14.0", "signature": {"inputs": {"InputLayer": {"name": "inputlayer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"Conv4": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Reflection/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_6/resize/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_7/resize/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_77", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "32"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputlayer", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_50/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_50/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_48/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_48/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_5/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_5/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_47/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_47/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_61/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_61/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_60/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_60/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_58/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_58/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_56/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_56/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_54/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_54/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_52/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_52/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Reflection/MirrorPad", "op": "MirrorPad", "input": ["inputlayer", "StatefulPartitionedCall/Transform_network/Reflection/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/Reflection/MirrorPad", "StatefulPartitionedCall/Transform_network/Conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_47/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_47/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_47/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_47/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_47/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_47/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_48/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv2/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_48/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_48/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_48/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_48/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_48/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv3/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice/stack", "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice/stack_1", "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "9"}, "begin_mask": {"i": "9"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_50/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_50/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_50/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_50/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_50/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_51/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_50/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_weights", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/Transform_network/add_16/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_51/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/add_16/add", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Transform_network/add_16/add", "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice/stack", "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice/stack_1", "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice/stack_2"], "attr": {"end_mask": {"i": "9"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "9"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_52/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_52/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_52/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_52/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_52/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_53/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_52/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_weights", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/Transform_network/add_17/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_53/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/add_17/add", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Transform_network/add_17/add", "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice/stack", "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice/stack_1", "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "9"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "9"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_54/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_54/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_54/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_54/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_54/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_55/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_54/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_weights", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/add_18/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_55/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/add_18/add", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Transform_network/add_18/add", "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice/stack", "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice/stack_1", "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "9"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "9"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_56/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_56/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_56/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_56/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_56/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_57/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_56/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_weights", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/Transform_network/add_19/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_57/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/add_19/add", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Transform_network/add_19/add", "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice/stack", "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice/stack_1", "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice/stack_2"], "attr": {"end_mask": {"i": "9"}, "begin_mask": {"i": "9"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_58/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_58/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_58/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_58/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_58/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_59/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_58/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_5/Conv2D_weights", "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Transform_network/add_20/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_59/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_6/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/Transform_network/add_20/add", "StatefulPartitionedCall/Transform_network/tf.image.resize_6/resize/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/tf.compat.v1.pad_4/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/Transform_network/tf.image.resize_6/resize/ResizeBilinear", "unknown_77"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/tf.compat.v1.pad_4/Pad", "StatefulPartitionedCall/Transform_network/Deconv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Deconv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_60/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Deconv1/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_60/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_60/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_60/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_60/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_7/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_60/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/tf.image.resize_7/resize/size"], "attr": {"half_pixel_centers": {"b": true}, "align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/tf.compat.v1.pad_5/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/Transform_network/tf.image.resize_7/resize/ResizeBilinear", "unknown_77"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Deconv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/tf.compat.v1.pad_5/Pad", "StatefulPartitionedCall/Transform_network/Deconv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Deconv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_61/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transform_network/Deconv2/Relu", "StatefulPartitionedCall/Transform_network/batch_normalization_61/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_61/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_61/FusedBatchNormV3/Mul", "StatefulPartitionedCall/Transform_network/batch_normalization_61/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Transform_network/batch_normalization_61/FusedBatchNormV3", "StatefulPartitionedCall/Transform_network/Conv4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Transform_network/Conv4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/Transform_network/Conv4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/Transform_network/Conv4/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_5/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_4/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_3/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1ResidualBlock_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Reflection/Const", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1/Conv2D/ReadVariableOp", "shape": [9, 9, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv3/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv3/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_16/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_17/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_18/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_19/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/cropping2d_20/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_6/resize/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/Deconv1/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Deconv1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/tf.image.resize_7/resize/size", "shape": [2], "dtype": "int32"}, {"name": "unknown_77", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Transform_network/Deconv2/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Deconv2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/Conv2D/ReadVariableOp", "shape": [9, 9, 32, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv4/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_50/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_50/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_1/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_49/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_2/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_3/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/batch_normalization_48/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Transform_network/Conv2ResidualBlock_4/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": 